jLetters = ['あ','い','う','え','お','は','ひ','ふ','へ','ほ','か','き','く','け','こ','ま','み','む','め','も','さ',
            'し','す','せ','そ','や','ゆ','よ','た','ち','つ','て','と','ら','り','る','れ','ろ','な','に','ぬ','ね',
            'の','わ','ゐ','ん','ゑ','を']

eLetter = ['a','i','oo','e','o','ha','hi','fu','he','ho','kka','ki','ko','ke','ko','ma','mi','mu','mi','mo','sa',
           'shi','su','se','so','ya','yu','yo','ta','chi','tsu','te','to','ra','ri','ru','re','ro','na','ni','nu','ne',
           'no','wa','wi','n','we','wo']